In [1]:
import pandas as pd
import numpy as np

In [26]:
data={'Name':['Sam','Bob','John','Mary'],'Age':[12,32,43,22],'Salary':[1000,2000,2222,5555]}
frame=pd.DataFrame(data,columns=['Name','Age','Salary'],index=[1,2,3,4])

In [35]:
print(frame)
print(frame.shape)
print(frame.head(3))
print(frame.tail(2))
print(frame.T)
print(frame.size)
print(frame.values)
print(frame.dtypes)

   Name  Age  Salary
1   Sam   12    1000
2   Bob   32    2000
3  John   43    2222
4  Mary   22    5555
(4, 3)
   Name  Age  Salary
1   Sam   12    1000
2   Bob   32    2000
3  John   43    2222
   Name  Age  Salary
3  John   43    2222
4  Mary   22    5555
           1     2     3     4
Name     Sam   Bob  John  Mary
Age       12    32    43    22
Salary  1000  2000  2222  5555
12
[['Sam' 12 1000]
 ['Bob' 32 2000]
 ['John' 43 2222]
 ['Mary' 22 5555]]
Name      object
Age        int64
Salary     int64
dtype: object

In [36]:
#replace
frame.replace({12:25,43:28})

   Name  Age  Salary
1   Sam   25    1000
2   Bob   32    2000
3  John   28    2222
4  Mary   22    5555

In [42]:
#axis
frame.axes

[Int64Index([1, 2, 3, 4], dtype='int64'),
 Index(['Name', 'Age', 'Salary'], dtype='object')]

In [43]:
frame

   Name  Age  Salary
1   Sam   12    1000
2   Bob   32    2000
3  John   43    2222
4  Mary   22    5555

In [52]:
#Reindex
frame=frame.reindex([4,6,2,1,3,5])

In [55]:
#isnull function
frame['Name'].isnull()

4    False
6     True
2    False
1    False
3    False
5     True
Name: Name, dtype: bool

In [58]:
#isna
frame['Name'].isna()

4    False
6     True
2    False
1    False
3    False
5     True
Name: Name, dtype: bool

In [60]:
frame['Age'].notnull()

4     True
6    False
2     True
1     True
3     True
5    False
Name: Age, dtype: bool

In [62]:
frame['Salary'].fillna(0)

4    5555.0
6       0.0
2    2000.0
1    1000.0
3    2222.0
5       0.0
Name: Salary, dtype: float64

In [65]:
frame['Salary'].sum()

10777.0

In [67]:
#fillna with method pad
frame.fillna(method='pad')

   Name   Age  Salary
4  Mary  22.0  5555.0
6  Mary  22.0  5555.0
2   Bob  32.0  2000.0
1   Sam  12.0  1000.0
3  John  43.0  2222.0
5  John  43.0  2222.0

In [68]:
#fillna with method backfill
frame.fillna(method='backfill')

   Name   Age  Salary
4  Mary  22.0  5555.0
6   Bob  32.0  2000.0
2   Bob  32.0  2000.0
1   Sam  12.0  1000.0
3  John  43.0  2222.0
5   NaN   NaN     NaN

In [69]:
#dropna
frame.dropna()

   Name   Age  Salary
4  Mary  22.0  5555.0
2   Bob  32.0  2000.0
1   Sam  12.0  1000.0
3  John  43.0  2222.0

# Series

In [70]:
s=pd.Series([1,2,3,4,5])
s.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [77]:
print(s.tail(2))
print(s.dtype)
print(s.shape)
print(s.size)
print(s.ndim)
print(s.head)
print(s.axes)

3    4
4    5
dtype: int64
int64
(5,)
5
1
<bound method NDFrame.head of 0    1
1    2
2    3
3    4
4    5
dtype: int64>
[RangeIndex(start=0, stop=5, step=1)]

In [89]:
#Pandas for reading Files
df=pd.read_csv('temp1.txt',header=0)
print(df)

   Sr_no  Name  Age  Salary
0      1   Sam   45   25000
1      2   Tom   54   40000
2      3  John   33   45000
3      4   Bob   27   13000

In [81]:
#Custom index
df.set_index('Sr_no')

       Name  Age  Salary
Sr_no
1       Sam   45   25000
2       Tom   54   40000
3      John   33   45000
4       Bob   27   13000

In [93]:
df=pd.read_csv('temp1.txt',skiprows=1)
print(df)

   1   Sam  45  25000
0  2   Tom  54  40000
1  3  John  33  45000
2  4   Bob  27  13000